#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudfront_origin_access_identity.default: Refreshing state... [id=E3MZV8ZRF1OECX]
aws_s3_bucket.data: Refreshing state... [id=cesko-digital-kalkulacka-data]
aws_s3_bucket.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2]
aws_s3_bucket_acl.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2,private]
aws_s3_bucket_policy.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2]
aws_s3_bucket_server_side_encryption_configuration.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2]
aws_s3_bucket_server_side_encryption_configuration.data: Refreshing state... [id=cesko-digital-kalkulacka-data]
aws_s3_bucket_acl.data: Refreshing state... [id=cesko-digital-kalkulacka-data,private]
aws_s3_bucket_policy.data: Refreshing state... [id=cesko-digital-kalkulacka-data]
aws_cloudfront_distribution.distribution: Refreshing state... [id=EQ9HHUGA34PWX]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cloudfront_distribution.distribution has changed
  ~ resource "aws_cloudfront_distribution" "distribution" {
        id                             = "EQ9HHUGA34PWX"
      ~ in_progress_validation_batches = 1 -> 0
        tags                           = {}
        # (18 unchanged attributes hidden)






        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.backend-expire-old will be created
  + resource "aws_ecr_lifecycle_policy" "backend-expire-old" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire images older than 14 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 14
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "backend"
    }

  # aws_ecr_repository.backend will be created
  + resource "aws_ecr_repository" "backend" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "backend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @martinwenisch, Action: `pull_request`*